//****************************************************************************
//****************************************************************************
//**                                                                        **
//**            (C)Copyright 1993-2017 Supermicro Computer, Inc.            **
//**                                                                        **
//****************************************************************************
//****************************************************************************
//  File History
//
//  Rev. 1.06
//      Bug Fixed:  Add tRWSR w/a setup option for Samsung DIMMs.
//      Reason:     Improve memory RX margin
//      Auditor:    Stephen Chen
//      Date:       Aug/18/2017
//
//  Rev. 1.05
//      Bug Fixed:  Remove default string "Empty" from memory item.
//      Reason:     
//      Auditor:    Kasber Chen
//      Date:       Mar/30/2017
//
//  Rev. 1.04
//      Bug Fixed:  1.Change setup item [Refresh Options] name to [2X REFRESH].
//                  2.Modify setup item [2X REFRESH] behavior.
//      Reason:     
//      Auditor:    Jimmy Chiu
//      Date:       Mar/29/2017
//
//  Rev. 1.03
//      Bug Fixed:  Add tCCD_L Relaxation setup option for specific DIMMs.
//      Reason:     Requested by Micron, code reference from Jian.
//      Auditor:    Jacker Yeh
//      Date:       Mar/17/2017
//
//  Rev. 1.02
//      Bug Fixed:  Add NVDIMM feature.
//      Reason:     
//      Auditor:    Leon Xu
//      Date:       Jan/12/2017
//
//  Rev. 1.01
//      Bug Fixed:  Modify String "Acc Self Refr" to "Accelerated Self Refresh"
//      Reason:     
//      Auditor:    Mark chen
//      Date:       Jan/20/2017
//
//  Rev. 1.00
//      Bug Fixed:  Support SMC Memory map-out function.
//      Reason:     
//      Auditor:    Ivern Yeh
//      Date:       Jul/07/2016
//
//****************************************************************************
//
// This file contains an 'Intel Peripheral Driver' and is
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may
// be modified by the user, subject to additional terms of the
// license agreement
//
// *++
//
// Copyright (c) 1999 - 2016 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
//
//
// Module Name:
//
//   MemorySetupStrings.uni
//
// Abstract:
//
//   String definitions for Memory
//
// Revision History:
//
// --*/

/=#

#langdef   en-US "English"

//
// Memory Interface Configuration
//
#string STR_MEMORY_CONFIG_FORM_TITLE    #language en-US "Memory Configuration"
#string STR_MEMORY_CONFIG_FORM_HELP     #language en-US "Displays and provides option to change the Memory Settings"

#string STR_MEMORY_RAS_CONFIG_FORM_TITLE    #language en-US "Memory RAS Configuration"
#string STR_MEMORY_RAS_CONFIG_FORM_HELP     #language en-US "Displays and provides option to change the Memory Ras Settings"
#string STR_RAS_CONFIG_SETUP                #language en-US "Memory RAS Configuration Setup"

#string STR_MEMORY_NGN_CONFIG_FORM_TITLE    #language en-US "NGN Configuration"
#string STR_MEMORY_NGN_CONFIG_FORM_HELP     #language en-US "Displays and provides option to change the NGN settings"
#string STR_NGN_CONFIG_SETUP                #language en-US "NGN Configuration Setup"

#string STR_IOH_MEM_FORM_TITLE              #language en-US "Integrated Memory Controller (iMC)"

#string STR_1                               #language en-US "1"
#string STR_2                               #language en-US "2"
#string STR_3                               #language en-US "3"
#string STR_4                               #language en-US "4"
#string STR_5                               #language en-US "5"
#string STR_6                               #language en-US "6"
#string STR_7                               #language en-US "7"
#string STR_8                               #language en-US "8"
#string STR_16                              #language en-US "16"
#string STR_32                              #language en-US "32"
#string STR_64                              #language en-US "64"
#string STR_128                             #language en-US "128"

#string STR_STANDARD_DEFAULT_PROMPT     #language en-US "Standard Default"
#string STR_MANUFACTURE_DEFAULT_PROMPT  #language en-US "Manufacture Default"

// Supermicro +
#string STR_MEMORY_MAPOUT_PROMPT            #language en-US "Memory Map-Out"
#string STR_MEMORY_MAPOUT_HELP              #language en-US "Enable to map-out memory module when failed"
// Supermicro -

#string STR_ENFORCE_POR_PROMPT              #language en-US "Enforce POR"
#string STR_ENFORCE_POR_HELP                #language en-US "POR - Enforces Plan Of Record restrictions for DDR4 frequency and voltage programming. Disable - Disables this feature."
#string STR_POR                             #language en-US "Enforce POR"
//#string STR_STRETCH                         #language en-US "Enforce Stretch Goals"

#string STR_PPO_INTERPOSER_PROMPT              #language en-US "PPO Interposer"
#string STR_PPO_INTERPOSER_HELP                #language en-US "Enable will choose PPO Interposer 2, Disable or Auto will choose PPO interposer 1"

#string STR_RASMODE_PROMPT                  #language en-US "RAS Mode"
#string STR_RASMODE_HELP                    #language en-US "Mirror Mode will set entire 1LM/2LM memory in system to be mirrored, consequently reducing the memory capacity by half. If Rank Sparing is enabled, Mirroring will not take effect"

#string STR_LOCKSTEPMODE_PROMPT             #language en-US "Static Virtual Lockstep Mode"
#string STR_LOCKSTEPMODE_HELP               #language en-US "Enable Static Virtual Lockstep mode"

#string STR_MIRROR_1LM                      #language en-US "Mirror Mode 1LM"
#string STR_MIRROR_2LM                      #language en-US "Mirror Mode 2LM"
#string STR_LOCKSTEP                        #language en-US "Lockstep Mode"

#string STR_PMIRR1LM                        #language en-US "Partial Mirror mode 1LM"
#string STR_PMIRR2LM                        #language en-US "Partial Mirror mode 2LM"

#string STR_MIRRORMODE_PROMPT               #language en-US "Mirror mode"
#string STR_MIRRORMODE_HELP                 #language en-US "Mirror Mode will set entire 1LM/2LM memory in system to be mirrored, consequently reducing the memory capacity by half. Mirror Enable will disable XPT Prefetch"

#string STR_PARTIAL_MIRR_UEFI_PROMPT        #language en-US "UEFI ARM Mirror"
#string STR_PARTIAL_MIRR_UEFI_HELP          #language en-US "Imitate behavior of UEFI based Address Range Mirror with setup option"

#string STR_PARTIAL_MIRR_PERCENT_PROMPT        #language en-US "ARM Mirror percentage"
#string STR_PARTIAL_MIRR_PERCENT_HELP          #language en-US "Enter the percentage to be mirrored in basis points. 12.75% is represented 1275"

#string STR_SRAT_PROMPT                     #language en-US "Publish SRAT"
#string STR_SRAT_HELP                       #language en-US "Publish the SRAT ACPI table to the OS."

#string STR_SRAT_MEM_HOT_PLUG_PROMPT        #language en-US "SRAT Memory Hot Plug"
#string STR_SRAT_MEM_HOT_PLUG_HELP          #language en-US "Fix for OS that does not support memory hot plug.\nEx: SuSE SLES10 SP2. \n \nEnable by default. \nDisable will clear all hot plug bits and remove the hot plug entries in SRAT table."

#string STR_SRAT_CPU_HOT_PLUG_PROMPT        #language en-US "SRAT CPU Hot Plug"
#string STR_SRAT_CPU_HOT_PLUG_HELP          #language en-US "Set Processor Flag to Enabled for all processor entries in SRAT."

#string STR_BAD_CHNL_FIRST                  #language en-US "Bad Channel First (legacy)"
#string STR_DIR_SCRUB                       #language en-US "Direct Scrub"
#string STR_SWAP_MAPOUT                     #language en-US "Channel Runtime Mirror Swap and Channel Mapout"
#string STR_HRMFO_THRSLD_PROMPT             #language en-US "HRMFO Threshold"
#string STR_HRMFO_THRSLD_HELP               #language en-US "Configure HRMFO Threshold"

#string STR_PARTIAL_SAD0_PROMPT             #language en-US "Mirror TAD0"
#string STR_PARTIAL_SAD0_HELP               #language en-US "Enable Mirror on entire memory for TAD0"

#string STR_PARTIAL_MIRR_PROMPT             #language en-US "Enable Partial Mirror"
#string STR_PARTIAL_MIRR_HELP               #language en-US "Partial mirror mode will enable the required size of memory to be mirrored. If rank sparing is enabled partial mirroring will not take effect. Mirror Enable will disable XPT Prefetch"
#string STR_MIRR1_SIZE_PROMPT                #language en-US "Partial Mirror1 Size in GB"
#string STR_MIRR2_SIZE_PROMPT                #language en-US "Partial Mirror2 Size in GB"
#string STR_MIRR3_SIZE_PROMPT                #language en-US "Partial Mirror3 Size in GB"
#string STR_MIRR4_SIZE_PROMPT                #language en-US "Partial Mirror4 Size in GB"
#string STR_MIRR_SIZE_HELP                  #language en-US "Select multiplier of 1 GB for the Size of the SAD to be created"

#string STR_PAGE_POLICY_PROMPT              #language en-US "Page Policy"
#string STR_PAGE_POLICY_HELP                #language en-US "Select Page Policy"
#string STR_CLOSED_PAGE                     #language en-US "Closed"
#string STR_OPEN_PAGE                       #language en-US "Open"
#string STR_ADAPTIVE_PAGE                   #language en-US "Adaptive"

#string STR_DDR_FREQ_800_STRING             #language en-US "800"
#string STR_DDR_FREQ_1000_STRING            #language en-US "1000"
#string STR_DDR_FREQ_1066_STRING            #language en-US "1066"
#string STR_DDR_FREQ_1200_STRING            #language en-US "1200"
#string STR_DDR_FREQ_1333_STRING            #language en-US "1333"
#string STR_DDR_FREQ_1400_STRING            #language en-US "1400"
#string STR_DDR_FREQ_1600_STRING            #language en-US "1600"
#string STR_DDR_FREQ_1800_STRING            #language en-US "1800"
#string STR_DDR_FREQ_1866_STRING            #language en-US "1866"
#string STR_DDR_FREQ_2000_STRING            #language en-US "2000"
#string STR_DDR_FREQ_2133_STRING            #language en-US "2133"
#string STR_DDR_FREQ_2200_STRING            #language en-US "2200"
#string STR_DDR_FREQ_2400_STRING            #language en-US "2400"
#string STR_DDR_FREQ_2600_STRING            #language en-US "2600"
#string STR_DDR_FREQ_2666_STRING            #language en-US "2666"
#string STR_DDR_FREQ_2800_STRING            #language en-US "2800-OvrClk"
#string STR_DDR_FREQ_2933_STRING            #language en-US "2933-OvrClk"
#string STR_DDR_FREQ_3000_STRING            #language en-US "3000-OvrClk"
#string STR_DDR_FREQ_3200_STRING            #language en-US "3200-OvrClk"
#string STR_DDR_FREQ_3400_STRING            #language en-US "3400-OvrClk"
#string STR_DDR_FREQ_3466_STRING            #language en-US "3466-OvrClk"
#string STR_DDR_FREQ_3600_STRING            #language en-US "3600-OvrClk"
#string STR_DDR_FREQ_3733_STRING            #language en-US "3733-OvrClk"
#string STR_DDR_FREQ_3800_STRING            #language en-US "3800-OvrClk"
#string STR_DDR_FREQ_4000_STRING            #language en-US "4000-OvrClk"
#string STR_DDR_FREQ_4200_STRING            #language en-US "4200-OvrClk"
#string STR_DDR_FREQ_4266_STRING            #language en-US "4266-OvrClk"
#string STR_DDR_FREQ_4400_STRING            #language en-US "4400-OvrClk"
#string STR_DDR_FREQ_800_RESVD_STRING       #language en-US "Reserved"
#string STR_DDR_FREQ_1000_RESVD_STRING      #language en-US "Reserved"
#string STR_DDR_FREQ_1066_RESVD_STRING      #language en-US "Reserved"
#string STR_DDR_FREQ_1200_RESVD_STRING      #language en-US "Reserved"

#string STR_IMC_BCLK_PROMPT                 #language en-US "IMC BCLK"
#string STR_IMC_BCLK_HELP                   #language en-US "Auto, 100MHz or 133MHz"
#string STR_100                             #language en-US "100MHz"
#string STR_133                             #language en-US "133MHz"

#string STR_DRAM_MAINT_PROMPT               #language en-US "DRAM Maintenance"
#string STR_DRAM_MAINT_HELP                 #language en-US "Select Manual to customize DRAM Maintenance settings"

#string STR_DRAM_MAINT_MODE_PROMPT          #language en-US "DRAM Maintenance Mode"
#string STR_DRAM_MAINT_MODE_HELP            #language en-US "Select between pTRR and TRR mode"

#string STR_DRAM_MAINT_TRR_PROMPT           #language en-US "TRR Mode"
#string STR_DRAM_MAINT_TRR_HELP             #language en-US "Select between TRR mode A and B"

#string STR_PTRR_MODE                       #language en-US "pTRR Mode"
#string STR_TRR_MODE                        #language en-US "TRR Mode"
#string STR_TRR_MODE_A                      #language en-US "TRR Mode A"
#string STR_TRR_MODE_B                      #language en-US "TRR Mode B"

#string STR_PATROL_SCRUB_PROMPT             #language en-US "Patrol Scrub"
#string STR_PATROL_SCRUB_HELP               #language en-US "Enable/Disable Patrol Scrub"

#string STR_PATROL_SCRUB_DURATION_PROMPT    #language en-US "Patrol Scrub Interval"
#string STR_PATROL_SCRUB_DURATION_HELP      #language en-US "Selects the number of hours (1-24) required to complete full scrub. A value of zero means auto!"

#string STR_PATROL_SCRUB_ADDRMODE_PROMPT    #language en-US "Patrol Scrub Address Mode"
#string STR_PATROL_SCRUB_ADDRMODE_HELP      #language en-US "Selects the address mode between System Physical Address (or) Reverse Address"

#string STR_SPA                             #language en-US "System Physical Address"
#string STR_REVERSE_ADDR                    #language en-US "Reverse Address"

#string STR_DEMAND_SCRUB_PROMPT             #language en-US "Demand Scrub"
#string STR_DEMAND_SCRUB_HELP               #language en-US "Enable/Disable Demand Scrub"

#string STR_SPAREERRTH_PROMPT               #language en-US "Correctable Error Threshold"
#string STR_SPAREERRTH_HELP                 #language en-US "Correctable Error Threshold (1 - 32767) used for sparing, tagging, and leaky bucket"

#string NGN_DIE_SPARING_PROMPT              #language en-US "Set NGN Die Sparing"
#string NGN_DIE_SPARING_HELP                #language en-US "Enable/Disable NGN Die Sparing"

#string NGN_DIE_SPARING_AGGRESSIVENESS_PROMPT      #language en-US "NGN Die Sparing Aggressiveness"
#string NGN_DIE_SPARING_AGGRESSIVENESS_HELP        #language en-US "How aggressive to be on die sparing (0...255); default is 128, 0 means no die is spared"

#string STR_SDDC_PLUSONE_EN_PROMPT          #language en-US "SDDC Plus One"
#string STR_SDDC_PLUSONE_EN_HELP            #language en-US "Enable/Disable SDDC Plus One"

#string STR_SDDC_EN_PROMPT                  #language en-US "SDDC"
#string STR_SDDC_EN_HELP                    #language en-US "Enable/Disable SDDC"


#string STR_ADDDC_PROMPT                    #language en-US "ADDDC Sparing"
#string STR_ADDDC_HELP                      #language en-US "Enable/Disable ADDDC Sparing"

#string STR_ADDDC_ERR_INJ_PROMPT             #language en-US "Enable ADDDC Error Injection"
#string STR_ADDDC_ERR_INJ_HELP               #language en-US "Enable/Disable ADDDC error injection. This requires to force the interleave granularity to 64B for B/L step parts"

#ifdef SV_HOOKS
#string STR_EXTENDED_ADDDC_PROMPT           #language en-US "Extended ADDDC sparing"
#string STR_EXTENDED_ADDDC_HELP             #language en-US "Enable/Disable Extended ADDDC sparing"
#endif

#string STR_LEAKY_BKT_LO_PROMPT             #language en-US "Leaky bucket low bit"
#string STR_LEAKY_BKT_LO_HELP               #language en-US "Leaky bucket low bit" (1 - 63)"

#string STR_LEAKY_BKT_HI_PROMPT             #language en-US "Leaky bucket high bit"
#string STR_LEAKY_BKT_HI_HELP               #language en-US "Leaky bucket high bit" (1 - 63)"

#string STR_WRITE_POSTING_PROMPT            #language en-US "Write Posting"
#string STR_WRITE_POSTING_HELP              #language en-US "Enable/Disable Write Posting"

#string STR_MEM_FLOWS_PROMPT             #language en-US "Mem Flows"
#string STR_MEM_FLOWS_HELP               #language en-US "Enable(1)/Disable(0) memory training steps in MRC flow; X_OVER-BIT0; SENSE_AMP-BIT1; E_CMDCLK-BIT2; REC_EN-BIT3; RD_DQS-BIT4; WR_LVL-BIT5; WR_FLYBY-BIT6; WR_DQ-BIT7; CMDCLK-BIT8; RD_ADV-BIT9; WR_ADV-BIT10; RD_VREF-BIT11; WR_VREF-BIT12; RT_OPT-BIT13; RX_DESKEW-BIT14; TX_DESKEW-BIT14; TX_EQ-BIT15; IMODE-BIT16; EARLY_RID-BIT17; DQ_SWIZ-BIT18; LRBUF_RD-BIT19; LRBUF_WR-BIT20; RANK_MARGIN-BIT21; EARLY_WR_VREF-BIT22; EARLY_RD_VREF-BIT23; LR_RD_VREF-BIT24; MEM_INIT-BIT25; FNVSIMICSSIM_EN-BIT26; NORMAL_MODE-BIT27; CMD_VREF-BIT28; LR_WR_VREF-BIT29; MEMTEST-BIT30; E_CTLCLK-BIT31"

#string STR_MEM_FLOWS_EXT_PROMPT         #language en-US "Mem FlowsExt"
#string STR_MEM_FLOWS_EXT_HELP           #language en-US "Enable(1)/Disable(0) memory training steps in MRC flow; RX_CTLE-BIT0; PXC-BIT1; CMD_NORM-BIT2; BIOS_SSA_RMT-BIT3; MC_ODT-BIT4; MC_RON-BIT5; DIMM_RON-BIT6; RTT_WRT-BIT7; NONTGT_ODT-BIT8"

#string STR_PPR_TYPE                      #language en-US "PPR Type"
#string STR_PPR_TYPE_HELP                 #language en-US "Selects Post Package Repair Type - Hard / Soft / Disabled. Auto - Sets it to the MRC default setting; current default is Disabled."
#string STR_PPR_TYPE_HARD                 #language en-US "Hard PPR"
#string STR_PPR_TYPE_SOFT                 #language en-US "Soft PPR"
#string STR_PPR_DISABLED                  #language en-US "PPR Disabled"

#string STR_PPR_ERR_INJ                   #language en-US "PPR Error Injection test"
#string STR_PPR_ERR_INJ_HELP              #language en-US "Enable / Disable support for c-script err inj test"

#string STR_RANK_MASK_EN_PROMPT             #language en-US "DIMM Rank Enable Mask"
#string STR_RANK_MASK_EN_HELP               #language en-US "Selects ranks to enable/disable per DIMM"

#string STR_SCKT_0_CH_0_RANK_EN_PROMPT      #language en-US "Socket 0 Channel 0 Rank Enable BitMask"
#string STR_SOCKET_0_CH_0_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 0 Channel 0, possible values from 0 to 255"

#string STR_SCKT_0_CH_1_RANK_EN_PROMPT      #language en-US "Socket 0 Channel 1 Rank Enable BitMask"
#string STR_SOCKET_0_CH_1_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 0 Channel 1, possible values from 0 to 255"

#string STR_SCKT_0_CH_2_RANK_EN_PROMPT      #language en-US "Socket 0 Channel 2 Rank Enable BitMask"
#string STR_SOCKET_0_CH_2_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 0 Channel 2, possible values from 0 to 255"

#string STR_SCKT_0_CH_3_RANK_EN_PROMPT      #language en-US "Socket 0 Channel 3 Rank Enable BitMask"
#string STR_SOCKET_0_CH_3_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 0 Channel 3, possible values from 0 to 255"

#string STR_SCKT_0_CH_4_RANK_EN_PROMPT      #language en-US "Socket 0 Channel 4 Rank Enable BitMask"
#string STR_SOCKET_0_CH_4_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 0 Channel 4, possible values from 0 to 255"

#string STR_SCKT_0_CH_5_RANK_EN_PROMPT      #language en-US "Socket 0 Channel 5 Rank Enable BitMask"
#string STR_SOCKET_0_CH_5_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 0 Channel 5, possible values from 0 to 255"

#string STR_SCKT_1_CH_0_RANK_EN_PROMPT      #language en-US "Socket 1 Channel 0 Rank Enable BitMask"
#string STR_SOCKET_1_CH_0_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 1 Channel 0, possible values from 0 to 255"

#string STR_SCKT_1_CH_1_RANK_EN_PROMPT      #language en-US "Socket 1 Channel 1 Rank Enable BitMask"
#string STR_SOCKET_1_CH_1_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 1 Channel 1, possible values from 0 to 255"

#string STR_SCKT_1_CH_2_RANK_EN_PROMPT      #language en-US "Socket 1 Channel 2 Rank Enable BitMask"
#string STR_SOCKET_1_CH_2_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 1 Channel 2, possible values from 0 to 255"

#string STR_SCKT_1_CH_3_RANK_EN_PROMPT      #language en-US "Socket 1 Channel 3 Rank Enable BitMask"
#string STR_SOCKET_1_CH_3_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 1 Channel 3, possible values from 0 to 255"

#string STR_SCKT_1_CH_4_RANK_EN_PROMPT      #language en-US "Socket 1 Channel 4 Rank Enable BitMask"
#string STR_SOCKET_1_CH_4_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 1 Channel 4, possible values from 0 to 255"

#string STR_SCKT_1_CH_5_RANK_EN_PROMPT      #language en-US "Socket 1 Channel 5 Rank Enable BitMask"
#string STR_SOCKET_1_CH_5_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 1 Channel 5, possible values from 0 to 255"

#string STR_SCKT_2_CH_0_RANK_EN_PROMPT      #language en-US "Socket 2 Channel 0 Rank Enable BitMask"
#string STR_SOCKET_2_CH_0_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 2 Channel 0, possible values from 0 to 255"

#string STR_SCKT_2_CH_1_RANK_EN_PROMPT      #language en-US "Socket 2 Channel 1 Rank Enable BitMask"
#string STR_SOCKET_2_CH_1_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 2 Channel 1, possible values from 0 to 255"

#string STR_SCKT_2_CH_2_RANK_EN_PROMPT      #language en-US "Socket 2 Channel 2 Rank Enable BitMask"
#string STR_SOCKET_2_CH_2_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 2 Channel 2, possible values from 0 to 255"

#string STR_SCKT_2_CH_3_RANK_EN_PROMPT      #language en-US "Socket 2 Channel 3 Rank Enable BitMask"
#string STR_SOCKET_2_CH_3_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 2 Channel 3, possible values from 0 to 255"

#string STR_SCKT_2_CH_4_RANK_EN_PROMPT      #language en-US "Socket 2 Channel 4 Rank Enable BitMask"
#string STR_SOCKET_2_CH_4_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 2 Channel 4, possible values from 0 to 255"

#string STR_SCKT_2_CH_5_RANK_EN_PROMPT      #language en-US "Socket 2 Channel 5 Rank Enable BitMask"
#string STR_SOCKET_2_CH_5_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 2 Channel 5, possible values from 0 to 255"

#string STR_SCKT_3_CH_0_RANK_EN_PROMPT      #language en-US "Socket 3 Channel 0 Rank Enable BitMask"
#string STR_SOCKET_3_CH_0_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 3 Channel 0, possible values from 0 to 255"

#string STR_SCKT_3_CH_1_RANK_EN_PROMPT      #language en-US "Socket 3 Channel 1 Rank Enable BitMask"
#string STR_SOCKET_3_CH_1_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 3 Channel 1, possible values from 0 to 255"

#string STR_SCKT_3_CH_2_RANK_EN_PROMPT      #language en-US "Socket 3 Channel 2 Rank Enable BitMask"
#string STR_SOCKET_3_CH_2_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 3 Channel 2, possible values from 0 to 255"

#string STR_SCKT_3_CH_3_RANK_EN_PROMPT      #language en-US "Socket 3 Channel 3 Rank Enable BitMask"
#string STR_SOCKET_3_CH_3_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 3 Channel 3, possible values from 0 to 255"

#string STR_SCKT_3_CH_4_RANK_EN_PROMPT      #language en-US "Socket 3 Channel 4 Rank Enable BitMask"
#string STR_SOCKET_3_CH_4_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 3 Channel 4, possible values from 0 to 255"

#string STR_SCKT_3_CH_5_RANK_EN_PROMPT      #language en-US "Socket 3 Channel 5 Rank Enable BitMask"
#string STR_SOCKET_3_CH_5_RANK_EN_HELP      #language en-US "Enable/Disable Ranks On Socket 3 Channel 5, possible values from 0 to 255"

#string STR_MEM_SPARING_EN_PROMPT           #language en-US "Memory Rank Sparing"
#string STR_MEM_SPARING_EN_HELP             #language en-US "Enable/Disable Memory Rank Sparing"

#string STR_MEM_MULTISPARING_PROMPT         #language en-US "Multi Rank Sparing"
#string STR_MEM_MULTISPARING_HELP           #language en-US "Set Multi Rank Sparing number, default and the maximum is 2 ranks per channel"

#string STR_ONERANK_SPARE                   #language en-US "One Rank"
#string STR_TWORANK_SPARE                   #language en-US "Two Rank"

#string STR_PROMOTE_MRC_WARNING_PROMPT      #language en-US "MRC Promote Warnings"
#string STR_PROMOTE_MRC_WARNING_HELP        #language en-US "Determines if MRC warnings are promoted to system level"

#string STR_DDR_MEMORY_TYPE_PROMPT          #language en-US "Memory Type"
#string STR_DDR_MEMORY_TYPE_HELP            #language en-US "Selects the Memory type supported by this platform."
#string STR_UDIMM_ONLY                      #language en-US "UDIMMs only"
#string STR_RDIMM_ONLY                      #language en-US "RDIMMs only"
#string STR_UDIMM_RDIMM                     #language en-US "UDIMMs and RDIMMs"

#string STR_ALLOW_CORRECTABLE_ERROR_EN_PROMPT #language en-US "Allow Correctables"
#string STR_ALLOW_CORRECTABLE_ERROR_EN_HELP   #language en-US "Enable - Allows correctable errors during memory training. Disable - Disables this feature. Auto - Sets it to the MRC default setting; current default is Enable."

#string STR_DLL_RESET_TEST_PROMPT           #language en-US "DLL Reset Test"
#string STR_DLL_RESET_TEST_HELP             #language en-US "Set this to the number of loops to execute the DDL reset test. The test will execute RMT for the provided number of loops without DLL resets and then it will exectue RMT for the same number of loops with DLL resets."

#string STR_MEMTOPOLOGY_DISPLAY_FORM_TITLE  #language en-US "Memory Topology"
#string STR_MEMTOPOLOGY_DISPLAY_FORM_HELP   #language en-US "Displays memory topology with Dimm population information"

#string STR_MEM_TEST_PROMPT                 #language en-US "MemTest"
#string STR_MEM_TEST_HELP                   #language en-US "Enable - Enables memory test during normal boot. Disable - Disables this feature. Auto - Sets it to MRC default setting; current default is Enable."

#string STR_MEM_TEST_LOOPS_PROMPT           #language en-US "MemTestLoops"
#string STR_MEM_TEST_LOOPS_HELP             #language en-US "Number of memory test loops during normal boot, set to 0 to run memtest infinitely"
#string STR_SW_MEM_TEST_PROMPT              #language en-US "SW MemTest"
#string STR_SW_MEM_TEST_HELP                #language en-US "Enable/disable software memory test during normal boot"

#string STR_MEM_TEST_FAST_BOOT_PROMPT       #language en-US "MemTest On Fast Boot"
#string STR_MEM_TEST_FAST_BOOT_HELP         #language en-US "Enable - Enables memory test during fast boot. Disable - Disables this feature. Auto - Sets it to the MRC default setting; current default is Disable."

#string STR_ATTEMPT_FAST_BOOT_PROMPT        #language en-US "Attempt Fast Boot"
#string STR_ATTEMPT_FAST_BOOT_HELP          #language en-US "Enable - Portions of memory reference code will be skipped when possible to increase boot speed on warm boots. Disable - Disables this feature. Auto - Sets it to the MRC default setting; current default is Disable."

#string STR_ATTEMPT_FAST_BOOT_COLD_PROMPT   #language en-US "Attempt Fast Cold Boot"
#string STR_ATTEMPT_FAST_BOOT_COLD_HELP     #language en-US "Enable - Portions of memory reference code will be skipped when possible to increase boot speed on cold boots. Disable - Disables this feature. Auto - Sets it to the MRC default setting; current default is Disable."

#string STR_SECURE_ERASE_UNIT_SUBTITLE       #language en-US "NGNVM DIMM Secure Erase Unit"
#string STR_SET_SECURE_ERASE_UNIT_HELP       #language en-US "Erases the persistent memory region of the selected DIMMs"
#string STR_SET_SECURE_ERASE                 #language en-US "Erase All DIMMs"
#string STR_SET_SECURE_ERASE_HELP            #language en-US "Erases the persistent memory region of all NVMDIMMs in the system"

#string STR_SECURE_ERASE_S0_CH0          #language en-US "S0 CH0"
#string STR_SECURE_ERASE_S0_CH0_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 0, Memory controller 0, Socket 0"
#string STR_SECURE_ERASE_S0_CH1          #language en-US "S0 CH1"
#string STR_SECURE_ERASE_S0_CH1_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 1, Memory controller 0, Socket 0"
#string STR_SECURE_ERASE_S0_CH2          #language en-US "S0 CH2"
#string STR_SECURE_ERASE_S0_CH2_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 2, Memory controller 0, Socket 0"
#string STR_SECURE_ERASE_S0_CH3          #language en-US "S0 CH3"
#string STR_SECURE_ERASE_S0_CH3_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 0, Memory controller 1, Socket 0"
#string STR_SECURE_ERASE_S0_CH4          #language en-US "S0 CH4"
#string STR_SECURE_ERASE_S0_CH4_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 1, Memory controller 1, Socket 0"
#string STR_SECURE_ERASE_S0_CH5          #language en-US "S0 CH5"
#string STR_SECURE_ERASE_S0_CH5_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 2, Memory controller 1, Socket 0"

#string STR_SECURE_ERASE_S1_CH0          #language en-US "S1 CH0"
#string STR_SECURE_ERASE_S1_CH0_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 0, Memory controller 0, Socket 1"
#string STR_SECURE_ERASE_S1_CH1          #language en-US "S1 CH1"
#string STR_SECURE_ERASE_S1_CH1_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 1, Memory controller 0, Socket 1"
#string STR_SECURE_ERASE_S1_CH2          #language en-US "S1 CH2"
#string STR_SECURE_ERASE_S1_CH2_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 2, Memory controller 0, Socket 1"
#string STR_SECURE_ERASE_S1_CH3          #language en-US "S1 CH3"
#string STR_SECURE_ERASE_S1_CH3_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 0, Memory controller 1, Socket 1"
#string STR_SECURE_ERASE_S1_CH4          #language en-US "S1 CH4"
#string STR_SECURE_ERASE_S1_CH4_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 1, Memory controller 1, Socket 1"
#string STR_SECURE_ERASE_S1_CH5          #language en-US "S1 CH5"
#string STR_SECURE_ERASE_S1_CH5_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 2, Memory controller 1, Socket 1"

#string STR_SECURE_ERASE_S2_CH0          #language en-US "S2 CH0"
#string STR_SECURE_ERASE_S2_CH0_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 0, Memory controller 0, Socket 2"
#string STR_SECURE_ERASE_S2_CH1          #language en-US "S2 CH1"
#string STR_SECURE_ERASE_S2_CH1_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 1, Memory controller 0, Socket 2"
#string STR_SECURE_ERASE_S2_CH2          #language en-US "S2 CH2"
#string STR_SECURE_ERASE_S2_CH2_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 2, Memory controller 0, Socket 2"
#string STR_SECURE_ERASE_S2_CH3          #language en-US "S2 CH3"
#string STR_SECURE_ERASE_S2_CH3_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 0, Memory controller 1, Socket 2"
#string STR_SECURE_ERASE_S2_CH4          #language en-US "S2 CH4"
#string STR_SECURE_ERASE_S2_CH4_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 1, Memory controller 1, Socket 2"
#string STR_SECURE_ERASE_S2_CH5          #language en-US "S2 CH5"
#string STR_SECURE_ERASE_S2_CH5_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 2, Memory controller 1, Socket 2"

#string STR_SECURE_ERASE_S3_CH0          #language en-US "S3 CH0"
#string STR_SECURE_ERASE_S3_CH0_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 0, Memory controller 0, Socket 3"
#string STR_SECURE_ERASE_S3_CH1          #language en-US "S3 CH1"
#string STR_SECURE_ERASE_S3_CH1_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 1, Memory controller 0, Socket 3"
#string STR_SECURE_ERASE_S3_CH2          #language en-US "S3 CH2"
#string STR_SECURE_ERASE_S3_CH2_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 2, Memory controller 0, Socket 3"
#string STR_SECURE_ERASE_S3_CH3          #language en-US "S3 CH3"
#string STR_SECURE_ERASE_S3_CH3_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 0, Memory controller 1, Socket 3"
#string STR_SECURE_ERASE_S3_CH4          #language en-US "S3 CH4"
#string STR_SECURE_ERASE_S3_CH4_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 1, Memory controller 1, Socket 3"
#string STR_SECURE_ERASE_S3_CH5          #language en-US "S3 CH5"
#string STR_SECURE_ERASE_S3_CH5_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 2, Memory controller 1, Socket 3"

#string STR_SECURE_ERASE_S4_CH0          #language en-US "S4 CH0"
#string STR_SECURE_ERASE_S4_CH0_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 0, Memory controller 0, Socket 4"
#string STR_SECURE_ERASE_S4_CH1          #language en-US "S4 CH1
#string STR_SECURE_ERASE_S4_CH1_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 1, Memory controller 0, Socket 4"
#string STR_SECURE_ERASE_S4_CH2          #language en-US "S4 CH2"
#string STR_SECURE_ERASE_S4_CH2_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 2, Memory controller 0, Socket 4"
#string STR_SECURE_ERASE_S4_CH3          #language en-US "S4 CH3"
#string STR_SECURE_ERASE_S4_CH3_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 0, Memory controller 1, Socket 4"
#string STR_SECURE_ERASE_S4_CH4          #language en-US "S4 CH4"
#string STR_SECURE_ERASE_S4_CH4_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 1, Memory controller 1, Socket 4"
#string STR_SECURE_ERASE_S4_CH5          #language en-US "S4 CH5"
#string STR_SECURE_ERASE_S4_CH5_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 2, Memory controller 1, Socket 4"

#string STR_SECURE_ERASE_S5_CH0          #language en-US "S5 CH0"
#string STR_SECURE_ERASE_S5_CH0_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 0, Memory controller 0, Socket 5"
#string STR_SECURE_ERASE_S5_CH1          #language en-US "S5 CH1"
#string STR_SECURE_ERASE_S5_CH1_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 1, Memory controller 0, Socket 5"
#string STR_SECURE_ERASE_S5_CH2          #language en-US "S5 CH2"
#string STR_SECURE_ERASE_S5_CH2_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 2, Memory controller 0, Socket 5"
#string STR_SECURE_ERASE_S5_CH3          #language en-US "S5 CH3"
#string STR_SECURE_ERASE_S5_CH3_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 0, Memory controller 1, Socket 5"
#string STR_SECURE_ERASE_S5_CH4          #language en-US "S5 CH4"
#string STR_SECURE_ERASE_S5_CH4_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 1, Memory controller 1, Socket 5"
#string STR_SECURE_ERASE_S5_CH5          #language en-US "S5 CH5"
#string STR_SECURE_ERASE_S5_CH5_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 2, Memory controller 1, Socket 5"

#string STR_SECURE_ERASE_S6_CH0          #language en-US "S6 CH0"
#string STR_SECURE_ERASE_S6_CH0_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 0, Memory controller 0, Socket 6"
#string STR_SECURE_ERASE_S6_CH1          #language en-US "S6 CH1"
#string STR_SECURE_ERASE_S6_CH1_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 1, Memory controller 0, Socket 6"
#string STR_SECURE_ERASE_S6_CH2          #language en-US "S6 CH2"
#string STR_SECURE_ERASE_S6_CH2_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 2, Memory controller 0, Socket 6"
#string STR_SECURE_ERASE_S6_CH3          #language en-US "S6 CH3"
#string STR_SECURE_ERASE_S6_CH3_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 0, Memory controller 1, Socket 6"
#string STR_SECURE_ERASE_S6_CH4          #language en-US "S6 CH4"
#string STR_SECURE_ERASE_S6_CH4_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 1, Memory controller 1, Socket 6"
#string STR_SECURE_ERASE_S6_CH5          #language en-US "S6 CH5"
#string STR_SECURE_ERASE_S6_CH5_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 2, Memory controller 1, Socket 6"

#string STR_SECURE_ERASE_S7_CH0          #language en-US "S7 CH0"
#string STR_SECURE_ERASE_S7_CH0_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 0, Memory controller 0, Socket 7"
#string STR_SECURE_ERASE_S7_CH1          #language en-US "S7 CH1"
#string STR_SECURE_ERASE_S7_CH1_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 1, Memory controller 0, Socket 7"
#string STR_SECURE_ERASE_S7_CH2          #language en-US "S7 CH2"
#string STR_SECURE_ERASE_S7_CH2_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 2, Memory controller 0, Socket 7"
#string STR_SECURE_ERASE_S7_CH3          #language en-US "S7 CH3"
#string STR_SECURE_ERASE_S7_CH3_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 0, Memory controller 1, Socket 7"
#string STR_SECURE_ERASE_S7_CH4          #language en-US "S7 CH4"
#string STR_SECURE_ERASE_S7_CH4_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 1, Memory controller 1, Socket 7"
#string STR_SECURE_ERASE_S7_CH5          #language en-US "S7 CH5"
#string STR_SECURE_ERASE_S7_CH5_HELP     #language en-US "Erases the persistent memory region of NVMDIMM in Channel 2, Memory controller 1, Socket 7"

#string STR_VOL_MEM_MODE                    #language en-US "Volatile Memory Mode"
#string STR_VOL_MEM_MODE_HELP          #language en-US "Selects whether 1LM or 2LM memory mode should be enabled"
#string STR_1LM                             #language en-US "1LM"
#string STR_2LM                             #language en-US "2LM"

#string STR_BLK_MEM_MODE                    #language en-US "Block Memory Mode"
#string STR_BLK_MEM_MODE_HELP          #language en-US "Selects whether block memory should be enabled"
#string STR_NON_BLK_MODE                     #language en-US "Non Block memory mode"
#string STR_BLK_MODE                              #language en-US "Block memory mode"

#string STR_MEM_INT_GRAN_1LM                #language en-US "1LM Memory Interleave Granularity"
#string STR_MEM_INT_GRAN_1LM_HELP           #language en-US "Selects the 1LM memory interleave granularity"
#string STR_256B_256B                       #language en-US "256B Target, 256B Channel"
#string STR_64B_64B                         #language en-US "64B Target, 64B Channel"

#string STR_SKT_INTERLEAVE_BELOW4GB         #language en-US "Socket Interleave Below 4GB"
#string STR_SKT_INTERLEAVE_BELOW4GB_HELP    #language en-US "Splits the 0-4GB address space between two sockets, so that both sockets get a chunk of local memory below 4GB"

#string STR_IMC_INTERLEAVING_PROMPT         #language en-US "IMC Interleaving"
#string STR_IMC_INTERLEAVING_HELP           #language en-US "Select IMC Interleaving setting"

#string STR_CHANNEL_INTERLEAVING_PROMPT     #language en-US "Channel Interleaving"
#string STR_CHANNEL_INTERLEAVING_HELP       #language en-US "Select Channel Interleaving setting"
#string STR_RANK_INTERLEAVING_PROMPT        #language en-US "Rank Interleaving"
#string STR_RANK_INTERLEAVING_HELP          #language en-US "Select Rank Interleaving setting"

#string STR_1WAY_STRING                     #language en-US "1-way Interleave"
#string STR_2WAY_STRING                     #language en-US "2-way Interleave"
#string STR_3WAY_STRING                     #language en-US "3-way Interleave"
#string STR_4WAY_STRING                     #language en-US "4-way Interleave"
#string STR_6WAY_STRING                     #language en-US "6-way Interleave"
#string STR_8WAY_STRING                     #language en-US "8-way Interleave"

#string STR_CKE_THROT_PROMPT                #language en-US "CKE Throttling"
#string STR_CKE_THROT_PROMPT_HELP           #language en-US "Configures CKE Throttling"
#string STR_APD                             #language en-US "APD On"
#string STR_PPDF                            #language en-US "PPDF On"
#string STR_PPDS                            #language en-US "PPDS On"
#string STR_APD_PPDF                        #language en-US "APD On, PPDF On"
#string STR_APD_PPDS                        #language en-US "APD On, PPDS On"

#string STR_CK_SELF_REFRESH_PROMPT          #language en-US "CK in SR"
#string STR_CK_SELF_REFRESH_PROMPT_HELP     #language en-US "Configures CK behavior during self-refresh"
#string STR_DRIVEN                          #language en-US "Driven"
#string STR_TRI_STATE                       #language en-US "Tri-State"
#string STR_PULL_LOW                        #language en-US "Pulled Low"
#string STR_PULL_HIGH                       #language en-US "Pulled High"

#string STR_OPP_SR_PROMPT                   #language en-US "Opportunistic SR"
#string STR_OPP_SR_PROMPT_HELP              #language en-US "Enables or disables opportunistic self-refresh"


#string STR_DDR_VOLTAGE_PROMPT              #language en-US "DDR3 Voltage Level"
#string STR_DDR_VOLTAGE_HELP                #language en-US "Auto - If all dimms are 1.35V capable then set to 1.35V else set to 1.50V, Force - All DIMMs forced to 1.50V operation."
#string STR_DDR_FORCE_150                   #language en-US "Force to 1.50V"
#string STR_DDR_FORCE_135                   #language en-US "Force to 1.35V"

#string STR_BANK_XOR_PROMPT                 #language en-US "Bank XOR"
#string STR_BANK_XOR_HELP                   #language en-US "Enables Bank XORing to aleviate bank thrashing"

#string STR_PAGE_TABLE_ALIAS_PROMPT         #language en-US "Page Table Aliasing"
#string STR_PAGE_TABLE_ALIAS_HELP           #language en-US "Enables the bit to be set for Page Table Aliasing"
#string STR_SET_TO_0                        #language en-US "Set To 0"
#string STR_SET_TO_1                        #language en-US "Set To 1"

#string STR_BIOS_SSA_LOADER_PROMPT          #language en-US "BSSA Module Loader"
#string STR_BIOS_SSA_LOADER_HELP            #language en-US "Enables loading the BSSA test module"

#string STR_BIOS_SSA_RMT_PROMPT             #language en-US "BSSA Rank Margin Tool"
#string STR_BIOS_SSA_RMT_HELP               #language en-US "Enables the BSSA Rank Margin Tool"

#string STR_BIOS_SSA_RMT_FCB_PROMPT             #language en-US "BSSA RMT on Fast Cold Boot"
#string STR_BIOS_SSA_RMT_FCB_HELP               #language en-US "Enable/Disable the BSSA Rank Margin Tool on a Fast Cold Boot"

#string STR_BIOS_SSA_PER_BIT_PROMPT          #language en-US "Per Bit Margining"
#string STR_BIOS_SSA_PER_BIT_HELP            #language en-US "Enable Per Bit Margining"

#string STR_BIOS_SSA_DISPLAY_TABLE_PROMPT             #language en-US "Display Tables"
#string STR_BIOS_SSA_DISPLAY_TABLE_HELP               #language en-US "Enable displaying results as tables"

#string STR_BIOS_SSA_DISPLAY_PLOTS_PROMPT          #language en-US "Display Plots"
#string STR_BIOS_SSA_DISPLAY_PLOTS_HELP            #language en-US "Enable the display of per-bit results as plots"

#string STR_BIOS_SSA_LOOP_CNT_PROMPT             #language en-US "Loop Count"
#string STR_BIOS_SSA_LOOP_CNT_HELP               #language en-US "Exponential loop count for single rank test"

#string STR_BIOS_SSA_BACKSIDE_MARGINING_PROMPT          #language en-US "Backside Margining"
#string STR_BIOS_SSA_BACKSIDE_MARGINING_HELP            #language en-US "Enable margin test on the register or buffer backside"

#string STR_BIOS_SSA_EARLY_READ_ID_PROMPT             #language en-US "Early Read ID Margining"
#string STR_BIOS_SSA_EARLY_READ_ID_HELP               #language en-US "Enable NVMDIMM Early Read ID test"

#string STR_BIOS_SSA_STEP_SIZE_OVERRIDE_PROMPT          #language en-US "Step Size Override"
#string STR_BIOS_SSA_STEP_SIZE_OVERRIDE_HELP            #language en-US "Enable overriding the default step sizes"

#string STR_BIOS_SSA_RXDQS_PROMPT             #language en-US "RxDqs"
#string STR_BIOS_SSA_RXDQS_HELP               #language en-US "Step size of RxDqs. Auto: 1. Supported values: 1,2,4,8"

#string STR_BIOS_SSA_RXVREF_PROMPT             #language en-US "RxVref"
#string STR_BIOS_SSA_RXVREF_HELP               #language en-US "Step size of RxVref. Auto: 1. Supported values: 1,2,4,8"

#string STR_BIOS_SSA_TXDQ_PROMPT          #language en-US "TxDq"
#string STR_BIOS_SSA_TXDQ_HELP            #language en-US "Step size of TxDq. Auto: 1. Supported values: 1,2,4,8"

#string STR_BIOS_SSA_TXVREF_PROMPT             #language en-US "TxVref"
#string STR_BIOS_SSA_TXVREF_HELP               #language en-US "Step size of TxVref. Auto: 1. Supported values: 1,2,4,8"

#string STR_BIOS_SSA_CMDALL_PROMPT          #language en-US "CmdAll"
#string STR_BIOS_SSA_CMDALL_HELP            #language en-US "Step size of CmdAll. Auto: 1. Supported values: 1,2,4,8"

#string STR_BIOS_SSA_CMDVREF_PROMPT             #language en-US "CmdVref"
#string STR_BIOS_SSA_CMDVREF_HELP               #language en-US "Step size of CmdVref. Auto: 1. Supported values: 1,2,4,8"

#string STR_BIOS_SSA_CTLALL_PROMPT          #language en-US "CtlAll"
#string STR_BIOS_SSA_CTLALL_HELP            #language en-US "Step size of CtlAll. Auto: 1. Supported values: 1,2,4,8"

#string STR_BIOS_SSA_ERID_DELAY_PROMPT             #language en-US "EridDelay"
#string STR_BIOS_SSA_ERID_DELAY_HELP               #language en-US "Step size of EridDelay. Auto: 1. Supported values: 1,2,4,8"

#string STR_BIOS_SSA_ERID_VREF_PROMPT          #language en-US "EridVref"
#string STR_BIOS_SSA_ERID_VREF_HELP            #language en-US "Step size of EridVref. Auto: 1. Supported values: 1,2,4,8"

#string STR_BIOS_SSA_RMT_DEBUG_MSGS_PROMPT             #language en-US "RMT Debug Messages"
#string STR_BIOS_SSA_RMT_DEBUG_MSGS_HELP               #language en-US "Enables the BSSA RMT debug messages"

#string STR_LOG_PARSING_PROMPT              #language en-US "Enhanced Log Parsing"
#string STR_LOG_PARSING_HELP                #language en-US "Enables additional output in debug log for easier machine parsing"

#string STR_DDR_CYCLING_PROMPT              #language en-US "DDR Cycling"
#string STR_DDR_CYCLING_HELP                #language en-US "When enabled, MRC will train the memory and then power cycle over and over to stress MRC"

#string STR_ADR_ENABLE                      #language en-US "Enable ADR"
#string STR_ADR_ENABLE_HELP                 #language en-US "Enables the detecting and enabling of ADR"

#string STR_CHECK_PM_STS                    #language en-US "Check PCH_PM_STS"
#string STR_CHECK_PM_STS_HELP               #language en-US "Use the PCH_PM_STS regigister as a recovery indicator"

#string STR_CHECK_PLATFORM                  #language en-US "Check PlatformDetectADR"
#string STR_CHECK_PLATFORM_HELP             #language en-US "Use the PlatformDetectADR function as a recovery indicator"

#ifdef NVMEM_FEATURE_EN
#string STR_ADR_DATA_SAVE_MODE_HELP         #language en-US "Data Save Mode for ADR. Batterybacked or Type 01 NVDIMM"
#string STR_ADR_DATA_SAVE_MODE              #language en-US "ADR Data Save Mode"
#endif
#string STR_ADR_LEGACYMODE_EN               #language en-US "Legacy ADR Mode"
#string STR_ADR_LEGACYMODE_EN_HELP          #language en-US "Enable/Disable Legacy ADR Mode"

#string STR_ADR_DATASAVE_BBU                #language en-US "Batterybacked DIMMs"
#string STR_ADR_DATASAVE_DIS                #language en-US "Disable"

#ifdef MEM_NVDIMM_EN
#string STR_ADR_DATASAVE_NVDIMM             #language en-US "NVDIMMs"
#string STR_ERASEARM_NVDIMM                 #language en-US "Erase-Arm NVDIMMs"
#string STR_ERASEARM_NVDIMM_HELP            #language en-US "Enables/Disables Erasing and Arming NVDIMMs"
#string STR_RESTORE_NVDIMM                  #language en-US "Restore NVDIMMs"
#string STR_RESTORE_NVDIMM_HELP             #language en-US "Enables/Disables Automatic resotring of NVDIMMs"
#string STR_INTERLEAVE_NVDIMM               #language en-US "Interleave NVDIMMs"
#string STR_INTERLEAVE_NVDIMM_HELP          #language en-US "Controls if NVDIMMs are interleaved together or not"
#string STR_RESET_ADR                       #language en-US "Reset Trigger ADR"
#string STR_RESET_ADR_HELP                  #language en-US "Enables/Disables reset trigger ADR"
#string STR_SHUTDOWN_ADR                    #language en-US "S5 Trigger ADR"
#string STR_SHUTDOWN_ADR_HELP               #language en-US "Enables/Disables graceful shutdown trigger ADR"
#endif

#ifdef SMCPKG_SUPPORT
#string STR_GLOBAL_RESET				#language en-US " Reset Trigger ADR"
#string STR_GLOBAL_RESET_HELP				#language en-US "When system reset, issue a full reset instead in order to trigger ADR to save NVDIMM data"
#string STR_SET_NVDIMM_MEMORY_2_WRITE_THROUGH		#language en-US " Set NVDIMM to WT"
#string STR_SET_NVDIMM_MEMORY_2_WRITE_THROUGH_HELP	#language en-US "Set NVDIMM memory range to Write Through."
#string STR_SMC_GRACEFUL_SHUTDOWN_TRIGGER_ADR_MSG	#language en-US " S5 Trigger ADR"
#string STR_SMC_GRACEFUL_SHUTDOWN_TRIGGER_ADR_MSG_HELP	#language en-US "Normally only 4-sec power down or AC removal can trigger ADR. With this item enabled, OS S5 shutdown can also trigger ADR to save NVDIMM data"

#string STR_ADR_COMPLETE_TIMEOUT_MSG	#language en-US " ADR timeout"
#string STR_ADR_COMPLETE_TIMEOUT_MSG_HELP	#language en-US "The value programmed in this field determines how long a global reset included in the ADR flow will be delayed before actually triggering the reset."
#string STR_25US_STRING			#language en-US "25us"
#string STR_50US_STRING			#language en-US "50us"
#string STR_100US_STRING			#language en-US "100us"
#string STR_200US_STRING			#language en-US "200us"
#string STR_400US_STRING			#language en-US "400us"
#string STR_800US_STRING			#language en-US "800us"

#string STR_TCCDL_RELAX_PROMPT  #language en-US "tCCD_L Relaxation"
#string STR_TCCDL_RELAX_HELP    #language en-US "Auto: tCCD_L Relaxation will be enabled for selected & capable DIMMs. Disable: tCCD_L Relaxation is always disabled."

#string STR_TRWSR_EQUAL_PROMPT  #language en-US "Memory tRWSR Relaxation"
#string STR_TRWSR_EQUAL_HELP    #language en-US "Auto: Memory tRWSR Relaxation will be enabled for selected & capable DIMMs. Disable: Memory tRWSR Relaxation is always disabled."
#endif

#string STR_BDAT_EN_PROMPT                  #language en-US "BDAT"
#string STR_BDAT_EN_HELP                    #language en-US "Enable Disables BDAT"

#string STR_SCRAMBLE_EN_DDRT_PROMPT              #language en-US "Data Scrambling for NVMDIMM"
#string STR_SCRAMBLE_EN_DDRT_HELP                #language en-US "Enable - Enables data scrambling for NVMDIMM. Disable - Disables this feature. Auto - Sets it to the MRC default setting; current default is Enable."

#string STR_SCRAMBLE_EN_PROMPT              #language en-US "Data Scrambling for DDR4"
#string STR_SCRAMBLE_EN_HELP                #language en-US "Enable - Enables data scrambling for DDR4. Disable - Disables this feature. Auto - Sets it to the MRC default setting; current default is Enable."

#string STR_SCRAMBLE_SEED_LOW_PROMPT        #language en-US "Scrambling Seed Low"
#string STR_SCRAMBLE_SEED_LOW_HELP          #language en-US "Low 32 bits of the scrambling seed"
#string STR_SCRAMBLE_SEED_HIGH_PROMPT       #language en-US "Scrambling Seed High"
#string STR_SCRAMBLE_SEED_HIGH_HELP         #language en-US "High 32 bits of the scrambling seed"

#string STR_RMT_PROMPT                      #language en-US "Rank Margin Tool"
#string STR_RMT_HELP                        #language en-US "Enable - Enables the legacy rank margin tool to run after DDR4 memory training. Disable - Disables this feature. Auto - Sets it to MRC default setting; current default is Enable. Should be disabled in production releases."
#string STR_BACKSIDE_RMT_PROMPT             #language en-US "Backside RMT"
#string STR_BACKSIDE_RMT_HELP               #language en-US "Enable - Enables the legacy Backside Rank Margin Tool. Disable - Disables this feature. Auto - Sets it to MRC default setting; current default is Enable. Should be disabled for production releases."
#string STR_BACKSIDE_CMD_RMT_PROMPT         #language en-US "Backside CMD RMT"
#string STR_BACKSIDE_CMD_RMT_HELP           #language en-US "Enables the Backside CMD RMT"

#string STR_RMT_PATTERN_PROMPT              #language en-US "RMT Pattern Length"
#string STR_RMT_PATTERN_HELP                #language en-US "Sets the pattern length for the Rank Margin Tool"

#string STR_RMT_PATTERN_CMD_CTL_VREF_PROMPT              #language en-US "RMT Pattern Length CMD CTL VREF"
#string STR_RMT_PATTERN_CMD_CTL_VREF_HELP                #language en-US "Sets the pattern length for the Rank Margin Tool (CMD CTL VREF step)"

#string STR_RANK_MULT_PROMPT                #language en-US "Rank Multiplication"
#string STR_RANK_MULT_HELP                  #language en-US "Force the Rank Multiplication factor for LRDIMM"

#string STR_MODULE_DELAY_PROMPT             #language en-US "LRDIMM Module Delay"
#string STR_MODULE_DELAY_HELP               #language en-US "When Disabled, MRC will not use SPD bytes 90-95 for LRDIMM Module Delay. When Auto, MRC will boundary check the values and use default values, if SPD is 0 or out of range"

#string STR_PAGE_POLICY_DISPLAY_FORM_TITLE  #language en-US "Page Policy"
#string STR_PAGE_POLICY_DISPLAY_FORM_HELP   #language en-US "Set memory page policy parameters"

#string STR_MEMORY_TRAINING_DISPLAY_FORM_TITLE #language en-US "Memory Training"
#string STR_MEMORY_TRAINING_DISPLAY_FORM_HELP  #language en-US "DDR4 training options"

#string STR_EYE_DIAGRAM_PROMPT              #language en-US "Eye Diagrams"
#string STR_EYE_DIAGRAM_HELP                #language en-US "Enables Rx and Tx Dq eye diagrams for each rank"
#string STR_PER_BIT_MARGIN_PROMPT           #language en-US "Per Bit Margin"
#string STR_PER_BIT_MARGIN_HELP             #language en-US "Enable - Enables the logging from the serial port of DDR Per Bit Margin Data. Disable - Disables this feature. Auto - Sets it to the MRC default setting; current default is Disable."
#string STR_OPTION1                         #language en-US "Option 1"
#string STR_OPTION2                         #language en-US "Option 2"
#string STR_OPTION3                         #language en-US "Option 3"
#string STR_OPTION4                         #language en-US "Option 4"

#string STR_WRITE_PREAMBLE_PROMPT           #language en-US "Write Preamble TCLK"
#string STR_WRITE_PREAMBLE_HELP             #language en-US "Override WritePreamble to 1TCLK or 2TCLK for speeds 2400 and above"
#string STR_READ_PREAMBLE_PROMPT            #language en-US "Read Preamble TCLK"
#string STR_READ_PREAMBLE_HELP              #language en-US "Override ReadPreamble to 1TCLK or 2TCLK for speeds 2400 and above"
#string STR_1TCLK                           #language en-US "1TCLK"
#string STR_2TCLK                           #language en-US "2TCLK"

#string STR_WR_CRC_PROMPT                      #language en-US "WR CRC feature Control"
#string STR_WR_CRC_HELP                        #language en-US "Enable - Enables Write CRC. Disable - Disables this feature. Auto - Sets it to the MRC default setting; current default is Disable."

//RAS

#string STR_MEM_THERMAL_SUBTITLE            #language en-US "Memory Thermal"
#string STR_MEM_THERMAL_SUBTITLE_HELP       #language en-US "Set memory thermal settings"

#string STR_DDRT_MEM_PWR_SAV_PROMPT         #language en-US "NVMDIMM Mem Power Savings Mode"
#string STR_DDRT_MEM_PWR_SAV_PROMPT_HELP    #language en-US "Configures CKE and related NVMDIMM Memory Power Savings Features"
#string STR_DEEP                            #language en-US "Deep"
#string STR_SHALLOW                         #language en-US "Shallow"

#string STR_MEM_PWR_SAV_PROMPT              #language en-US "Mem Power Savings Mode"
#string STR_MEM_PWR_SAV_PROMPT_HELP         #language en-US "Configures CKE and related Memory Power Savings Features"
#string STR_SLOW                            #language en-US "Slow"
#string STR_FAST                            #language en-US "Fast"
#string STR_USER_DEF                        #language en-US "User Defined"

#string STR_MEM_PWR_SAVE_ADV_SUBTITLE       #language en-US "Memory Power Savings Advanced Options"
#string STR_MEM_PWR_SAVE_ADV_SUBTITLE_HELP  #language en-US "Advanced Settings for CKE and related Memory Power Savings Features"

#string STR_CKE_DISPLAY_FORM_TITLE          #language en-US "CKE Feature"
#string STR_CKE_DISPLAY_FORM_HELP           #language en-US "CKE Feature"
#string STR_SREF_DISPLAY_FORM_TITLE         #language en-US "Self Refresh Feature"
#string STR_SREF_DISPLAY_FORM_HELP          #language en-US "Self Refresh Feature"

#string STR_CKE_PROMPT                #language en-US "CKE Throttling"
#string STR_CKE_HELP           #language en-US "Configures CKE Throttling"

#string STR_SREF_PROMPT                     #language en-US "SREF Feature"
#string STR_SREF_HELP                       #language en-US "SREF Feature"
#string STR_SREF_STATIC_PROMPT              #language en-US "PKGC SREF EN"
#string STR_SREF_STATIC_HELP                #language en-US "PKGC SREF EN"

#string STR_CKE_IDLE_TIMER_PROMPT           #language en-US "CKE Idle Timer"
#string STR_CKE_IDLE_TIMER_HELP             #language en-US "CKE Idle Timer in ns. Value should be greater than 20 ns"
#string STR_APD_PROMPT                      #language en-US "APD"
#string STR_APD_HELP                        #language en-US "APD On/Off"
#string STR_PPD_PROMPT                      #language en-US "PPD"
#string STR_PPD_HELP                        #language en-US "PPD On/Off"
#string STR_DDRTCKE_PROMPT                  #language en-US "NVMDIMM CKE"
#string STR_DDRTCKE_HELP                    #language en-US "NVMDIMM CKE On/Off"

#string STR_SREF_IDLE_TIMER_PROMPT          #language en-US "SREF Idle Timer"
#string STR_SREF_IDLE_TIMER_HELP            #language en-US "SREF Idle Timer in ns."
#string STR_DDRT_SREF_PROMPT                #language en-US "NVMDIMM SELF REFRESH"
#string STR_DDRT_SREF_HELP                  #language en-US "NVMDIMM SELF REFRESH"
#string MDLL_OFF_PROMPT                     #language en-US "MDLL OFF"
#string MDLL_OFF_HELP                       #language en-US "MDLL OFF"

#string STR_OPP_SR_PROMPT                   #language en-US "Opportunistic SR"
#string STR_OPP_SR_HELP                     #language en-US "Enables or disables opportunistic self-refresh"
#string STR_CK_SELF_REFRESH_PROMPT          #language en-US "CK in SR"
#string STR_CK_SELF_REFRESH_PROMPT_HELP     #language en-US "Configures CK behavior during self-refresh"
#string STR_DRIVEN                          #language en-US "Driven"
#string STR_TRI_STATE                       #language en-US "Tri-State"
#string STR_PULL_LOW                        #language en-US "Pulled Low"
#string STR_PULL_HIGH                       #language en-US "Pulled High"

#string STR_OFF                             #language en-US "Off"

#string STR_MDLL_SDEN_PROMPT                #language en-US "MDLL Off"
#string STR_MDLL_SDEN_PROMPT_HELP           #language en-US "Enable to shut down MDLL during SR"

#string STR_MEMHOT_THROTTLING_MODE_PROMPT   #language en-US "MEMHOT Throttling Mode"
#string STR_MEMHOT_OUTPUT_THROTTLING_MODE_PROMPT   #language en-US "MEMHOT Output Throttling Mode Options"

#string STR_OUTPUT_H                               #language en-US "Enable only temphi"
#string STR_OUTPUT_HM                              #language en-US "Enable only temphi & mid"
#string STR_OUTPUT_HML                             #language en-US "Enable only temphi, mid and low"

#string STR_INPUT_OUTPUT_ENABLED            #language en-US "Input and Output Enabled"

#string STR_DIMMTEMPSTAT_PROMPT             #language en-US "DIMM Temperature override"
#string STR_DIMMTEMPSTAT_PROMPT_HELP        #language en-US "DIMM temperature for OLTT Mode"

#string STR_ELECTRICAL_THROTTLING_MODE_PROMPT       #language en-US "Mem Electrical Throttling"
#string STR_ELECTRICAL_THROTTLING_MODE_PROMPT_HELP  #language en-US "Configure Memory Electrical Throttling"

#string PPDS_IDLE_TIMER_PROMPT              #language en-US "PPDS idle counter."
#string PPDS_IDLE_TIMER_HELP                #language en-US "PPDS idle counter after all rank's rank idle counters (PDWN_IDEL_CNTR) have been expired."

#string STR_RMT_COLD_FAST_BOOT_PROMPT                        #language en-US "RMT On Cold Fast Boot"
#string STR_RMT_COLD_FAST_BOOT_HELP                        #language en-US "Enable - Enables Rank Margin Tool on Cold Fast Boot. Disable - Disables this feature. Auto - Sets it to the MRC default setting; current default is Enable. Should be disabled in production releases."

#string STR_MULTI_THREADED_PROMPT           #language en-US "Multi-Threaded MRC"
#string STR_MULTI_THREADED_HELP             #language en-US "Enable - Executes the Memory Reference Code multi-threaded. Disable - Disables this feature. Auto - Sets it to MRC default setting; current default is Enable."


#string STR_REFRESH_MODE_PROMPT             #language en-US "Refresh Options"
#string STR_REFRESH_MODE_HELP               #language en-US "Select self refresh mode"
#string STR_ACCELERATED_SELF_REFRESH        #language en-US "Accelerated Self Refresh"
#string STR_2X_REFRESH                      #language en-US "2x Refresh"

#string STR_HIGHER_SYS_ADDR_SPACE_PROMPT    #language en-US "Higher System Addres Space"
#string STR_HIGHER_SYS_ADDR_SPACE_HELP      #language en-US "Higher System Addres Space Disable/Enable"

#string STR_MC_BGF_THRESHOLD_PROMPT         #language en-US "MC BGF threshold"
#string STR_MC_BGF_THRESHOLD_HELP           #language en-US "The HA to MC BGF threshold is used for scheduling MC request in bypass condition."

#string STR_READ_VREF_CENTERING_PROMPT      #language en-US "Read Vref Centering"
#string STR_READ_VREF_CENTERING_HELP        #language en-US "Read Vref Centering Disable/Enable"

#string STR_WRITE_VREF_CENTERING_PROMPT     #language en-US "Write Vref Centering"
#string STR_WRITE_VREF_CENTERING_HELP       #language en-US "Write Vref Centering Disable/Enable"

#string STR_COMMAND_2_DATA_TUNING_PROMPT    #language en-US "Command 2 Data Tuning"
#string STR_COMMAND_2_DATA_TUNING_HELP      #language en-US "Command 2 Data Tuning Disable/Enable"

#string STR_HALT_ON_MEM_TRAINING_ERROR_PROMPT #language en-US "Halt on mem Training Error"
#string STR_HALT_ON_MEM_TRAINING_ERROR_HELP   #language en-US "Halt on mem Training Error Disable/Enable"

#string STR_FAN_SPD_CTRL_THRTL_MODE         #language en-US "Throttling Mode"
#string STR_FAN_SPD_CTRL_THRTL_MODE_HELP    #language en-US "Configure Thermal Throttling Mode."
#string STR_OPEN_LOOP_THERMAL_THROTTLING    #language en-US "OLTT"
#string STR_CLOSE_LOOP_THERMAL_THROTTLING   #language en-US "CLTT"
#string STR_CLOSE_LOOP_PECI_THERMAL_THROTTLING   #language en-US "CLTT with PECI"

#string STR_THERMTRIP_CONFIG        #language en-US "EN_MEMTRIP"
#string STR_THERMTRIP_CONFIG_HELP   #language en-US "If set to 0, processor will ignore MEMtrip. If set to 1 processor will include MEMtrip in ThermTrip tree."

#string STR_MEMHOT_THROTTLING_MODE_PROMPT_HELP  #language en-US "Configure MEMHOT Input and Output Mode: Mem Hot Sense Therm Throt or Mem Hot Output Therm Throt."
#string STR_MEMHOT_OUTPUT_THROTTLING_MODE_PROMPT_HELP  #language en-US "Configure MEMHOT Output Mode options: Enable/Disable the Throt Output high, mid and low bit fields."
#string STR_OPP_READ_DURING_WMM_PROMPT      #language en-US "Opp read during WMM"
#string STR_OPP_READ_DURING_WMM_HELP        #language en-US "Enable - Enables issuing read commands opportunistically during Write Major Mode. Disable - Disables this feature. Auto - Sets it to the MRC default setting; current default is Enable."

#string STR_NORM_OPP_INTERVAL_PROMPT        #language en-US "Normal Operation Duration"
#string STR_NORM_OPP_INTERVAL_HELP          #language en-US "Set normal operation duration interval (0 - 65535)"

#string STR_XMP_FORM_SUBTITLE               #language en-US "Memory Timings Override"
#string STR_XMP_PROFILE_PROMPT              #language en-US "XMP Profile"
#string STR_XMP_PROFILE_HELP                #language en-US "Selects the XMP profile to use"
#string STR_XMP_PROFILE1                    #language en-US "Profile 1"
#string STR_XMP_PROFILE2                    #language en-US "Profile 2"

#string STR_XMP_DDR_FREQ_LIMIT_PROMPT       #language en-US "Memory Frequency"
#string STR_XMP_DDR_FREQ_LIMIT_HELP         #language en-US "Maximum Memory Frequency Selections in Mhz. Do not select Reserved"

#string STR_VDD_PROMPT                      #language en-US "Memory Voltage"
#string STR_VDD_HELP                        #language en-US "Selects the desired memory voltage. To select 1.200V enter 1200."
#string STR_COMMAND_TIMING_PROMPT           #language en-US "Command Timing"
#string STR_COMMAND_TIMING_HELP             #language en-US "Selects the desired memory controller command timing"
#string STR_1N                              #language en-US "1N"
#string STR_2N                              #language en-US "2N"
#string STR_3N                              #language en-US "3N"
#string STR_CAS_LATENCY                     #language en-US "CAS Latency"
#string STR_CAS_LATENCY_HELP                #language en-US "0 - 4 = Auto, 5 - 11 = Desired CAS latency"
#string STR_TRP_LATENCY                     #language en-US "tRP"
#string STR_TRP_LATENCY_HELP                #language en-US "0 - 4 = Auto, 5 - 11 = Desired tRP latency"
#string STR_TRCD_LATENCY                    #language en-US "tRCD"
#string STR_TRCD_LATENCY_HELP               #language en-US "0 - 4 = Auto, 5 - 11 = Desired tRCD latency"
#string STR_TRAS_LATENCY                    #language en-US "tRAS"
#string STR_TRAS_LATENCY_HELP               #language en-US "0 = Auto else Desired tRAS latency"
#string STR_TWR_LATENCY                     #language en-US "tWR"
#string STR_TWR_LATENCY_HELP                #language en-US "0 = Auto else Desired tWR latency"
#string STR_TRFC_LATENCY                    #language en-US "tRFC"
#string STR_TRFC_LATENCY_HELP               #language en-US "0 = Auto else Desired tRFC"
#string STR_TRRD_LATENCY                    #language en-US "tRRD"
#string STR_TRRD_LATENCY_HELP               #language en-US "0 = Auto else Desired tRRD"
#string STR_TRTP_LATENCY                    #language en-US "tRTP"
#string STR_TRTP_LATENCY_HELP               #language en-US "0 = Auto else Desired tRTP"
#string STR_TWTR_LATENCY                    #language en-US "tWTR"
#string STR_TWTR_LATENCY_HELP               #language en-US "0 = Auto else Desired tWTR"
#string STR_TFAW_LATENCY                    #language en-US "tFAW"
#string STR_TFAW_LATENCY_HELP               #language en-US "0 = Auto else Desired tFAW"
#string STR_TCWL_LATENCY                    #language en-US "tCWL"
#string STR_TCWL_LATENCY_HELP               #language en-US "0 = Auto else Desired tCWL"
#string STR_TRC_LATENCY                     #language en-US "tRC"
#string STR_TRC_LATENCY_HELP                #language en-US "0 = Auto else Desired tRC"
#string STR_REFRESH_RATE                    #language en-US "Refresh Rate"
#string STR_REFRESH_RATE_HELP               #language en-US "0 = Auto, else time in nano seconds"

#string STR_DUTY_CYCLE_PROMPT               #language en-US "Duty Cycle Training"
#string STR_DUTY_CYCLE_HELP                 #language en-US "Enable/Disable Duty Cycle Training"

#string STR_ADVANCED_STROBE_CENTERING_PROMPT  #language en-US "Advanced Strobe Centering"
#string STR_ADVANCED_STROBE_CENTERING_HELP    #language en-US "Enable/Disable Advanced Strobe Centering"

#string STR_EXT_DIMM_VREF_CIRCUIT_PROMPT    #language en-US "Dimm Vref Ciruit"
#string STR_EXT_DIMM_VREF_CIRCUIT_HELP      #language en-US "Choose internal or external Dimm vref circuit"
#string STR_INTERNAL                        #language en-US "Internal"
#string STR_EXTERNAL                        #language en-US "External"

#string STR_PROMOTE_WARNINGS_PROMPT         #language en-US "Promote Warnings"
#string STR_PROMOTE_WARNINGS_HELP           #language en-US "Determines if warnings are promoted to system level"

#string STR_MEM_MAP_SUBTITLE                #language en-US "Memory Map"
#string STR_MEM_MAP_HELP                    #language en-US "Set memory mapping settings"

#string STR_BIOS_SSA_CONFIG_MENU_SUBTITLE                #language en-US "BSSA Configuration Menu"
#string STR_BIOS_SSA_CONFIG_MENU_HELP                    #language en-US "Configuration options for the BSSA Tool"

#string STR_NGN_BCOM_MARGIN_PROMPT          #language en-US "NVMDIMM BCOM Margining Support"
#string STR_NGN_BCOM_MARGIN_HELP            #language en-US "Enables NVMDIMM BCOM margining support for RMT and BSSA"

#string STR_CA_PARITY_PROMPT                #language en-US "C/A Parity Enable"
#string STR_CA_PARITY_HELP                  #language en-US "Enable - Enables DDR4 Command Address Parity. Disable - Disables this feature. Auto - Sets it to the MRC default setting; current default is Enable."

#string STR_DIMM_ISOLATION_PROMPT           #language en-US "DIMM Isolation Enable"
#string STR_DIMM_ISOLATION_HELP             #language en-US "Enable - Enables DIMM Isolation for Command/Address Parity and Write CRC. Disable - Disables this feature. Auto - Sets it to the MRC default setting; current default is Enable."

#string STR_SMB_SPEED_PROMPT                #language en-US "SMB Clock Frequency"
#string STR_SMB_SPEED_HELP                  #language en-US "Sets DDR4 SMBus Clock Frequencies For SPD Access. Auto - Sets it to the MRC default setting; current default is 400K."
#string STR_SMB_100K                        #language en-US "100 Khz"
#string STR_SMB_400K                        #language en-US "400 Khz"
#string STR_SMB_1M                          #language en-US "1 Mhz"

#string STR_TURNAROUND_PROMPT               #language en-US "Turnaround Time Optimization"
#string STR_TURNAROUND_HELP                 #language en-US "Enables optimal turnaround times"

#string STR_ONERANKTIMINGMODE_PROMPT        #language en-US "One Rank Timing Mode"
#string STR_ONERANKTIMINGMODE_HELP          #language en-US "LRDIMM One Rank Timing Mode turnaround time optimization"

#string STR_PDA_PROMPT                      #language en-US "PDA"
#string STR_PDA_HELP                        #language en-US "Enables Per DRAM Addressing"

#string STR_CUSTOMREFRESHRATEEN_PROMPT      #language en-US "Custom Refresh Enable"
#string STR_CUSTOMREFRESHRATEEN_HELP        #language en-US "Enable/disable a custom memory refresh rate"

#string STR_CUSTOMREFRESHRATE_PROMPT        #language en-US "Custom Refresh Rate"
#string STR_CUSTOMREFRESHRATE_HELP          #language en-US "Refresh Rate in 0.1x units of the standard 7.8 usec interval. Valid range is 20 to 40 (i.e. 2x to 4x)"

#string STR_FRC_MIRR_WR_TO_FAILED_EN_PROMPT #language en-US "frcmirrwrstofailed Enable Mask"
#string STR_FRC_MIRR_WR_TO_FAILED_EN_HELP   #language en-US "Selects frcmirrwrstofailed enable/disable"

#string STR_MIRR_FAIL_MODE_PROMPT           #language en-US "Mirror Fail-Over Mode"
#string STR_MIRR_FAIL_MODE_HELP             #language en-US "Direct Scrub will skip ECC correction and instead directly scrub the error using the mirror copy of data"

#string STR_STAGGER_REF_PROMPT              #language en-US "Stagger Ref Enable Mask"
#string STR_STAGGER_REF_HELP                #language en-US "Selects Stagger Ref enable/disable"

#string STR_LOCK_NGN_CSR_PROMPT              #language en-US "Lock NGN CSRs"
#string STR_LOCK_NGN_CSR_HELP                #language en-US "Enable\Disable Lock NGN CSRs"

#string STR_NGN_DEBUG_LOCK_PROMPT            #language en-US "Debug lock for NGN"
#string STR_NGN_DEBUG_LOCK_HELP              #language en-US "Enable\Disable Debug lock for NGN"

#string STR_NGN_CMD_TIME_PROMPT              #language en-US "NGN CMD Time"
#string STR_NGN_CMD_TIME_HELP                #language en-US "Select 1N\2N NGN Command tme"

#string STR_NGN_ECC_CORR_PROMPT              #language en-US "NGN ECC Correctable error"
#string STR_NGN_ECC_CORR_HELP                #language en-US "Enable\Disable NGN ECC Correctable error"

#string STR_NGN_ECC_WR_CHK_PROMPT            #language en-US "NGN ECC Write Check"
#string STR_NGN_ECC_WR_CHK_HELP              #language en-US "Enable\Disable NGN ECC Write Check"

#string STR_NGN_ECC_RD_CHK_PROMPT            #language en-US "NGN ECC Read Check"
#string STR_NGN_ECC_RD_CHK_HELP              #language en-US "Enable\Disable NGN ECC Read Check"

#string STR_BLOCK_GNT2CMD1CYC_PROMPT         #language en-US "BLOCK GNT2CMD1CYC"
#string STR_BLOCK_GNT2CMD1CYC_HELP           #language en-US "Enable\Disable BLOCK GNT2CMD1CYC"
#string STR_DIS_DDRT_OPPRD_PROMPT            #language en-US "Disable NVMDIMM OPPRD"
#string STR_DIS_DDRT_OPPRD_HELP              #language en-US "Enable\Disable Disable NVMDIMM OPPRD"

#string STR_NGN_ARS_ON_BOOT_PROMPT          #language en-US "ARS on Boot"
#string STR_NGN_ARS_ON_BOOT_HELP            #language en-US "Enable\Disable Address Range Scrub during boot time"

#string STR_CR_QOS_CONFIG_PROMPT             #language en-US "CR QoS Configuration"
#string STR_CR_QOS_CONFIG_HELP               #language en-US "Select CR QoS Configuration Profiles"


#string STR_POR                              #language en-US "POR"
#string STR_PO_SAFE                          #language en-US "PO Safe Value"

#string STR_TDP_POWER_PROMPT                #language en-US "Set TDP DIMM power limit"
#string STR_TDP_POWER_HELP                  #language en-US "Sets the current total dissipated DIMM power limit"
#string STR_10W                             #language en-US "10W"
#string STR_12W                             #language en-US "12W"
#string STR_15W                             #language en-US "15W"
#string STR_18W                             #language en-US "18W"
//SMCPKG_SUPPORT S
#string STR_MEM_STRING1           #language en-US "     "
#string STR_MEM_STRING2           #language en-US "     "
#string STR_MEM_STRING3           #language en-US "     "
#string STR_MEM_STRING4           #language en-US "     "
#string STR_MEM_STRING5           #language en-US "     "
#string STR_MEM_STRING6           #language en-US "     "
#string STR_MEM_STRING7           #language en-US "     "
#string STR_MEM_STRING8           #language en-US "     "
#string STR_MEM_STRING9           #language en-US "     "
#string STR_MEM_STRING10          #language en-US "     "
#string STR_MEM_STRING11          #language en-US "     "
#string STR_MEM_STRING12          #language en-US "     "
#string STR_MEM_STRING13          #language en-US "     "
#string STR_MEM_STRING14          #language en-US "     "
#string STR_MEM_STRING15          #language en-US "     "
#string STR_MEM_STRING16          #language en-US "     "
#string STR_MEM_STRING17          #language en-US "     "
#string STR_MEM_STRING18          #language en-US "     "
#string STR_MEM_STRING19          #language en-US "     "
#string STR_MEM_STRING20          #language en-US "     "
#string STR_MEM_STRING21          #language en-US "     "
#string STR_MEM_STRING22          #language en-US "     "
#string STR_MEM_STRING23          #language en-US "     "
#string STR_MEM_STRING24          #language en-US "     "
#string STR_MEM_STRING25          #language en-US "     "
#string STR_MEM_STRING26          #language en-US "     "
#string STR_MEM_STRING27          #language en-US "     "
#string STR_MEM_STRING28          #language en-US "     "
#string STR_MEM_STRING29          #language en-US "     "
#string STR_MEM_STRING30          #language en-US "     "
#string STR_MEM_STRING31          #language en-US "     "
#string STR_MEM_STRING32          #language en-US "     "
#string STR_MEM_STRING33          #language en-US "     "
#string STR_MEM_STRING34          #language en-US "     "
#string STR_MEM_STRING35          #language en-US "     "
#string STR_MEM_STRING36          #language en-US "     "
#string STR_MEM_STRING37          #language en-US "     "
#string STR_MEM_STRING38          #language en-US "     "
#string STR_MEM_STRING39          #language en-US "     "
#string STR_MEM_STRING40          #language en-US "     "
#string STR_MEM_STRING41          #language en-US "     "
#string STR_MEM_STRING42          #language en-US "     "
#string STR_MEM_STRING43          #language en-US "     "
#string STR_MEM_STRING44          #language en-US "     "
#string STR_MEM_STRING45          #language en-US "     "
#string STR_MEM_STRING46          #language en-US "     "
#string STR_MEM_STRING47          #language en-US "     "
#string STR_MEM_STRING48          #language en-US "     "
//SMCPKG_SUPPORT E
#string STR_CR_QOS_STRING0        #language en-US "Default (no QoS optimization)"
#string STR_CR_QOS_STRING1        #language en-US "Option 1"
#string STR_CR_QOS_STRING2        #language en-US "Option 2"
#string STR_CR_QOS_STRING3        #language en-US "Option 3"
#string STR_CR_QOS_STRING4        #language en-US "Option 4"
#string STR_CR_QOS_STRING5        #language en-US "Option 5"

#string STR_SPD_CRC_CHECK_PROMPT  #language en-US "SPD CRC Check"
#string STR_SPD_CRC_CHECK_HELP    #language en-US "Enable to turn on checking the SPD CRC"

//SMCPKG_SUPPORT - Start
#string STR_2X_REFRESH_PROMPT     #language en-US "2X REFRESH"
#string STR_2X_REFRESH_HELP       #language en-US "Select 2x refresh mode"

#string STR_MEM_ERR_LED_OFF_PROMPT      #language en-US "Turn off Memory Error LED"
#string STR_MEM_ERR_LED_OFF_HELP        #language en-US "Do nothing/Reset during next reset."
#string STR_MEM_DO_NOTHING              #language en-US "Do Nothing"
#string STR_MEM_ERASE_NEXT_BOOT         #language en-US "Yes, Next reset"
//SMCPKG_SUPPORT - End
//
// End of file
//
